app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---

    <%= collection_select(:article, :category_id, Category.all, :id, :name, prompt: true ) %>