app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "categories".* FROM "categories"
---
  def index

    @articles = Article.all
    @category = Category.all

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "asmae"], ["content", "asme bendjc jckd shj cjh ch khdkbkc  "], ["created_at", "2019-07-11 11:12:43.346742"], ["updated_at", "2019-07-11 11:12:43.346742"], ["user_id", 1]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "category_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["category_id", 715615992], ["updated_at", "2019-07-15 13:30:12.842977"], ["id", 980190978]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)