app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def find_category
    @category = Category.find(params[:id])